app/controllers/feeds_controller.rb

  def index
    @feeds = Feed.all
---
SELECT * FROM "feeds"

  def show
    @feed = Feed.find(params[:id])
---
SELECT * FROM "feeds" WHERE ("feeds"."id" = 1)

  def create
    @feed = Feed.new(params[:feed])

    respond_to do |format|
      if @feed.save
---
INSERT INTO "feeds" ("name", "updated_at", "url", "created_at") VALUES('helooo', '2009-06-21 02:49:05', 'http://www.etsy.com/rss_shop.php?user_id=5197906', '2009-06-21 02:49:05')

  def ngocoblak_publish
    client = TwitterOAuth::Client.new(
      :consumer_key => TwitterConfig::CONSUMER_NGOCOBLAK_KEY,
      :consumer_secret => TwitterConfig::CONSUMER_NGOCOBLAK_SECRET
    )
    request_token = client.request_token

    session[:request_token] = request_token.token
    session[:request_token_secret] = request_token.secret
    NgocoblakComment.create(:content => params[:content],:status => true)
---
INSERT INTO "ngocoblak_comments" ("permalink", "created_at", "updated_at", "content", "status") VALUES(NULL, '2009-08-26 04:00:41', '2009-08-26 04:00:41', 'hai', 't')